[
    {
      "_id": {"$oid": "664238f7cc710d9dfe710206"},
      "year": 1994,
      "genre": ["Drama", "Crime"],
      "age_rating": "U",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "Andy Dufresne, a banker wrongly imprisoned for the murder of his wife and her lover, is sentenced to life at the Shawshank State Penitentiary. Despite the oppressive conditions and brutal treatment, Andy maintains his hope and dignity. Over time, he forms a deep friendship with fellow inmate Ellis 'Red' Redding, and the two men find solace and redemption through acts of decency. Andy's ingenuity and determination ultimately lead to a daring escape that brings justice and change to Shawshank.",
      "id": 1,
      "title": "The Shawshank Redemption",
      "average_rating": 9.2,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BMDFkYTc0MGEtZmNhMC00ZDIzLWFmNTEtODM1ZmRlYWMwMWFmXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_FMjpg_UX674_.jpg",
      "director": "Frank Darabont",
      "actors": "Tim Robbins, Morgan Freeman, Bob Gunton"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe710207"},
      "year": 1972,
      "genre": ["Drama", "Crime"],
      "age_rating": "UA18+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "In 1940s New York, the powerful and secretive Corleone crime family is led by the aging patriarch Vito Corleone. When Vito's youngest son, Michael, returns from World War II, he is initially reluctant to join the family business. However, after an assassination attempt on his father, Michael becomes deeply involved in the family's criminal operations. As he rises to power, Michael's decisions lead to a bloody struggle for control and a transformation into a ruthless mafia leader, ultimately changing the Corleone family's legacy forever.",
      "id": 2,
      "title": "The Godfather",
      "average_rating": 9.2,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BM2MyNjYxNmUtYTAwNi00MTYxLWJmNWYtYzZlODY3ZTk3OTFlXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_FMjpg_UX674_.jpg",
      "director": "Francis Ford Coppola",
      "actors": "Marlon Brando, Al Pacino, James Caan"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe710208"},
      "year": 2008,
      "genre": ["Action", "Adventure"],
      "age_rating": "UA16+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "In the chaotic and crime-ridden Gotham City, Batman raises the stakes in his war on crime. With the help of Lieutenant Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the city. However, a new threat emerges in the form of the Joker, a psychopathic mastermind who unleashes a reign of terror. As Batman battles the Joker, he must confront his own limitations and the line between heroism and vigilantism, testing the strength of his resolve and the city's hope.",
      "id": 3,
      "title": "The Dark Knight",
      "average_rating": 9,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw@@._V1_FMjpg_UX674_.jpg",
      "director": "Christopher Nolan",
      "actors": "Christian Bale, Heath Ledger, Aaron Eckhart"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe710209"},
      "year": 1994,
      "genre": ["Drama", "Crime"],
      "age_rating": "UA18+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "Pulp Fiction weaves together multiple interconnected stories of crime and redemption in Los Angeles. Vincent Vega and Jules Winnfield are hitmen with a penchant for philosophical discussions. Vincent is tasked with taking his boss's wife, Mia Wallace, out for a night, leading to unexpected consequences. Meanwhile, boxer Butch Coolidge tries to flee town after double-crossing the mob. Each storyline intersects in a darkly comedic, violent, and unpredictable narrative that challenges conventional storytelling and redefines the crime genre.",
      "id": 4,
      "title": "Pulp Fiction",
      "average_rating": 8.9,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BNGNhMDIzZTUtNTBlZi00MTRlLWFjM2ItYzViMjE3YzI5MjljXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_FMjpg_UX674_.jpg",
      "director": "Quentin Tarantino",
      "actors": "John Travolta, Uma Thurman, Samuel L. Jackson"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe71020a"},
      "year": 1994,
      "genre": ["Drama", "Romance"],
      "age_rating": "UA7+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "Forrest Gump, a man with a low IQ, unwittingly influences several historical events throughout the 20th century in the United States. Despite his mental limitations, Forrest's kind-heartedness and determination lead him through a series of remarkable adventures, from serving in the Vietnam War to starting a successful shrimp business. Along the way, he experiences love, loss, and friendship, particularly with his childhood friend and love interest, Jenny. Forrest's journey is a testament to the power of perseverance and the impact one individual can have on the world.",
      "id": 5,
      "title": "Forrest Gump",
      "average_rating": 8.8,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BNWIwODRlZTUtY2U3ZS00Yzg1LWJhNzYtMmZiYmEyNmU1NjMzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_FMjpg_UX674_.jpg",
      "director": "Robert Zemeckis",
      "actors": "Tom Hanks, Robin Wright, Gary Sinise"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe71020b"},
      "year": 1999,
      "genre": ["Drama", "Thriller"],
      "age_rating": "UA18+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "Disillusioned with his white-collar job, an unnamed insomniac meets the eccentric soap salesman Tyler Durden. The two men form an underground fight club as a form of male bonding and rebellion against societal norms. As the club's popularity grows, it evolves into something far more sinister, spreading anarchistic chaos. The narrator's descent into madness and Tyler's true intentions culminate in a shocking revelation, challenging the protagonist's identity and purpose. Fight Club explores themes of masculinity, consumerism, and the search for meaning in modern society.",
      "id": 6,
      "title": "Fight Club",
      "average_rating": 8.8,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BNDIzNDU0YzEtYzE5Ni00ZjlkLTk5ZjgtNjM3NWE4YzA3Nzk3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_FMjpg_UX674_.jpg",
      "director": "David Fincher",
      "actors": "Brad Pitt, Edward Norton, Meat Loaf"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe71020c"},
      "year": 1999,
      "genre": ["Sci-fi", "Action"],
      "age_rating": "UA16+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "In a dystopian future, computer programmer Thomas Anderson, known by his hacker alias Neo, discovers the shocking truth about his reality. He learns that humanity is trapped in a simulated reality called the Matrix, created by intelligent machines to subdue the human population while their bodies are used as an energy source. Neo joins a group of rebels led by Morpheus, who believes Neo is 'The One' prophesied to free humanity. Together, they battle against the machines and their powerful agents, pushing Neo to unlock his full potential and change the course of history.",
      "id": 7,
      "title": "The Matrix",
      "average_rating": 8.7,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BNzQzOTk3OTAtNmNhMC00N2FlLTkyODctNWQ5Zjk2ZDNjYzAxXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_FMjpg_UX674_.jpg",
      "director": "Lana Wachowski, Lilly Wachowski",
      "actors": "Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe71020d"},
      "year": 1994,
      "genre": ["Drama"],
      "age_rating": "UA18+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "In the bustling streets of 1920s Tokyo, the quiet yet intelligent Keiko Miyazawa works as a typist in a law firm. Her life takes a dramatic turn when she witnesses a high-profile assassination. Fearing for her safety, Keiko is forced to navigate a dangerous web of political intrigue and corruption. Alongside a determined detective, she uncovers a conspiracy that threatens the very fabric of society. As the stakes grow higher, Keiko must decide between her safety and the pursuit of justice, all while confronting her own personal demons.",
      "id": 8,
      "title": "Tokyo Twilight",
      "average_rating": 8.7,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BZjhjNzY5NTQtYWM5Zi00MjE0LTllN2EtODgwNmNkOTBkMjQxXkEyXkFqcGdeQXVyMTEyMzQ2NTE1._V1_FMjpg_UX500_.jpg",
      "director": "Yasujirō Ozu",
      "actors": "Setsuko Hara, Ineko Arima, Chishū Ryū"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe71020e"},
      "year": 2014,
      "genre": ["Sci-fi", "Adventure"],
      "age_rating": "UA13+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "In the near future, Earth is facing environmental collapse, with crop failures and dust storms threatening humanity's survival. Former NASA pilot Cooper is recruited for a daring mission to explore a wormhole near Saturn, in search of a new habitable planet. Alongside a team of scientists, Cooper ventures into uncharted space, confronting unimaginable challenges and the limits of human endurance. Interstellar explores themes of love, sacrifice, and the unbreakable bonds between parents and children, culminating in a quest to ensure the survival of the human race.",
      "id": 9,
      "title": "Interstellar",
      "average_rating": 8.6,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BZjdkOTU3MDktN2IxOS00OGEyLWFmMjktY2FiMmZkNWIyODZiXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_FMjpg_UX674_.jpg",
      "director": "Christopher Nolan",
      "actors": "Matthew McConaughey, Anne Hathaway, Jessica Chastain"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe71020f"},
      "year": 2014,
      "genre": ["Drama", "Music"],
      "age_rating": "UA16+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "Andrew Neiman, a talented young drummer, enrolls at a prestigious music conservatory. His ambitions are met with the harsh and relentless mentorship of Terence Fletcher, an instructor known for his brutal teaching methods. As Andrew strives for perfection, the intense pressure and abusive tactics employed by Fletcher push him to the brink of his physical and mental limits. Whiplash is a gripping exploration of the pursuit of greatness, the cost of ambition, and the complex dynamics between student and teacher, culminating in an electrifying and unforgettable climax.",
      "id": 10,
      "title": "Whiplash",
      "average_rating": 8.5,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BOTA5NDZlZGUtMjAxOS00YTRkLTkwYmMtYWQ0NWEwZDZiNjEzXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_FMjpg_UX674_.jpg",
      "director": "Damien Chazelle",
      "actors": "Miles Teller, J.K. Simmons, Melissa Benoist"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe710210"},
      "year": 2019,
      "genre": ["Thriller", "Drama"],
      "age_rating": "UA18+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "In modern-day South Korea, the impoverished Kim family schemes to infiltrate the wealthy Park household by posing as unrelated, highly qualified individuals. As they secure positions within the Park family, the Kims revel in their new lifestyle. However, their deception leads to unforeseen consequences, exposing the deep divide between the rich and the poor. Parasite is a darkly humorous and thrilling exploration of social inequality, greed, and the lengths to which people will go to escape poverty, culminating in a shocking and unforgettable climax.",
      "id": 11,
      "title": "Parasite",
      "average_rating": 8.5,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BYWZjMjk3ZTItODQ2ZC00NTY5LWE0ZDYtZTI3MjcwN2Q5NTVkXkEyXkFqcGdeQXVyODk4OTc3MTY@._V1_FMjpg_UX674_.jpg",
      "director": "Bong Joon Ho",
      "actors": "Kang-ho Song, Sun-kyun Lee, Yeo-jeong Cho"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe710211"},
      "year": 2018,
      "genre": ["Family", "Action"],
      "age_rating": "UA7+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "Teenager Miles Morales is bitten by a radioactive spider and gains spider-like abilities. He soon discovers a parallel universe where he meets different versions of Spider-Man. Together, they must join forces to stop the villainous Kingpin from destroying all realities. Miles must embrace his unique identity and master his new powers to save the multiverse. Spider-Man: Into the Spider-Verse is a visually stunning and emotionally compelling adventure that celebrates diversity, heroism, and the enduring legacy of Spider-Man.",
      "id": 12,
      "title": "Spider-Man: Into the Spider-Verse",
      "average_rating": 8.3,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BMjMwNDkxMTgzOF5BMl5BanBnXkFtZTgwNTkwNTQ3NjM@._V1_FMjpg_UX674_.jpg",
      "director": "Peter Ramsey, Rodney Rothman, Bob Persichetti",
      "actors": "Shameik Moore, Jake Johnson, Hailee Steinfeld"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe710212"},
      "year": 2017,
      "genre": ["Family", "Adventure"],
      "age_rating": "U",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "Young Miguel dreams of becoming a musician, despite his family's ancestral ban on music. On Día de los Muertos, he accidentally enters the Land of the Dead, where he meets his ancestors and the charming trickster Héctor. Together, they embark on a journey to uncover Miguel's family history and the true story behind the ban on music. Coco is a heartwarming and visually stunning film that explores themes of family, tradition, and the power of music, culminating in a touching celebration of Mexican culture and heritage.",
      "id": 13,
      "title": "Coco",
      "average_rating": 8.4,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BNzE3NjM4MzY3OF5BMl5BanBnXkFtZTgwNjA3NjM4MzI@._V1_FMjpg_UX674_.jpg",
      "director": "Lee Unkrich, Adrian Molina",
      "actors": "Anthony Gonzalez, Gael García Bernal, Benjamin Bratt"
    },
    {
      "_id": {"$oid": "664238f7cc710d9dfe710213"},
      "year": 2010,
      "genre": ["Sci-fi", "Action"],
      "age_rating": "UA16+",
      "path": "http://127.0.0.1/Obeseus+vs+Bartigula+-+Simpsons+32x02.mp4",
      "plot": "Dom Cobb is a skilled thief with the rare ability to enter people's dreams and steal their secrets from their subconscious. He is offered a chance to have his criminal record erased in exchange for performing the impossible task of 'inception': planting an idea in someone's mind without them knowing. Cobb assembles a team of specialists to infiltrate the dream of a powerful corporate heir. As they delve deeper into the layers of dreams, Cobb confronts his own troubled past. Inception is a mind-bending thriller that explores the limits of the human mind and the power of dreams.",
      "id": 14,
      "title": "Inception",
      "average_rating": 8.8,
      "thumbnail_path": "https://m.media-amazon.com/images/M/MV5BMjAxMzY3ODI2Nl5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_FMjpg_UX674_.jpg",
      "director": "Christopher Nolan",
      "actors": "Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen Page"
    }
  ]
  